# coding=utf-8


# python特点：
# 1、简洁（非常简单）、易用，而且功能强大
# 2、可以桌面应用开发、网络编程、还可用于开发 Web 应用
# 3、Python 具有脚本语言中最丰 富和强大的类库，这些类库覆盖了文件、GUI、网络编程、数据 库访问、文本操作等绝大部分应用场景
# 4、跨平台

# python弱点
# 1、速度慢
# 2、加密难

# python存在两个版本：2.x和3.x,两者差异很大。但是我们只需要关注py3.x的版本
# 语言分为
# 1、[编译型语言 - AOT]。  一次新编译成机器代码。可以脱离开发环境。运行效率非常高。
# 2、[解释型语言 - JIT]。  每次执行解释型语言的程序都需要进行 一 次编译
# 而python是解释型语言


# MacOS安装python -> 已经预装python2（终端执行：python）、python3（终端执行：python3）


# 1、hello world
print("hello world")

# Python 程序不要求语句使用分号结尾，当然也可以使用分号.
# 但加分号并没有实质的作用(除非同一行有更多的代码)，而且这种做法也不是 Python 推荐的。
# 可以通过执行(python <Python 源程序路径> 来运行程序)：，比如上述可以通过运行：python part01_1.py

# 2.交互式解释器
# 当输入“ python”命令时,后面会有>>> 提示（交互器解释器提示符）， 用户可在该提示符后输入各种命令。
# 功能单一、简单；交互式解释器完全可作为一个“快速演练场”， 既可用于学习各种新语法，也可用于测试各种功能。相当于一个强大的计算器、语句执行器、



